КР3/src/Documents/ПрисвоитьРазряд/ПрисвоитьРазряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрисвоитьРазряд</name>
  <registerRecords>InformationRegister.РазрядыУчастников</registerRecords>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядЗвание</name>
      <type>
        <types>EnumRef.РазрядыИЗвания</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КР3/src/Documents/ПрисвоитьРазряд/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КомандаПодбор(Команда)
	Данные = Новый Структура;
	Данные.Вставить("Соревнование",втДокОбъект);
	Данные.Вставить("Новый",Ложь);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодбора",ЭтотОбъект);
	ОткрытьФорму("Документ.ПроведениеСоревнования.Форма.ПодборУчастников",Данные,ЭтотОбъект,Новый УникальныйИдентификатор,,,ОписаниеОповещения,СерверныеСервер.ПолучитьРежимОткрытияФормыПодбора());
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбора(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Для Каждого ТекСтрока Из Результат Цикл
			НовСтрока = Объект.Участники.Добавить();
			НовСтрока.Участник = ТекСтрока.Участник;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьСписок(Команда)
	ОткрытьФорму("Документ.ПрисвоитьРазряд.Форма.ЗагрузкаУчастников", , ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ПослеЗагрузкиСписка", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиСписка(Результат,ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Для каждого ТекСтр Из Результат Цикл
			НовСтрока = Объект.Участники.Добавить();
			НовСтрока.Участник = ТекСтр.Участник;
			НовСтрока.РазрядЗвание = ТекСтр.Разряд;
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры
